#+begin_src apex :tangle test.cls :org demonblack789@resilient-badger-6n1zk9.com :result filter|new
System.debug(UserInfo.getUsernmae());
#+end_src

#+RESULTS:
56.0 APEX_CODE,DEBUG;APEX_PROFILING,INFO
Execute Anonymous:
Execute Anonymous: System.debug('test');
12:45:17.167 (167711643)|USER_INFO|[EXTERNAL]|0055i000008AuNA|demonblack789@resilient-badger-6n1zk9.com|(GMT+07:00) Indochina Time (Asia/Ho_Chi_Minh)|GMT+07:00
12:45:17.167 (167757486)|EXECUTION_STARTED
12:45:17.167 (167766730)|CODE_UNIT_STARTED|[EXTERNAL]|execute_anonymous_apex
12:45:17.167 (168388849)|USER_DEBUG|[2]|DEBUG|test
12:45:17.168 (168467874)|CUMULATIVE_LIMIT_USAGE
12:45:17.168 (168467874)|LIMIT_USAGE_FOR_NS|(default)|
  Number of SOQL queries: 0 out of 100
  Number of query rows: 0 out of 50000
  Number of SOSL queries: 0 out of 20
  Number of DML statements: 0 out of 150
  Number of Publish Immediate DML: 0 out of 150
  Number of DML rows: 0 out of 10000
  Maximum CPU time: 0 out of 10000
  Maximum heap size: 0 out of 6000000
  Number of callouts: 0 out of 100
  Number of Email Invocations: 0 out of 10
  Number of future calls: 0 out of 50
  Number of queueable jobs added to the queue: 0 out of 50
  Number of Mobile Apex push calls: 0 out of 10

12:45:17.168 (168467874)|CUMULATIVE_LIMIT_USAGE_END

12:45:17.167 (168541956)|CODE_UNIT_FINISHED|execute_anonymous_apex
12:45:17.167 (168554083)|EXECUTION_FINISHED

#+begin_src apex-log :log-id 07L5i00000BD2ZTEA1 :org demonblack789@wise-impala-1canwi.com

#+end_src

#+RESULTS:
